chrisjenson/Oscilloscope_Senior_Project/tcom_engineering/embed_sw/tcom_app/tcom_app_psoc6_fixed_io/tcom_displ_test_psoc6.cydsn/Generated_Source/PSoC6/UART_KITPROG_USB.h
/***************************************************************************//**
* \file UART_KITPROG_USB.h
* \version 2.0
*
*  This file provides constants and parameter values for the UART component.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(UART_KITPROG_USB_CY_SCB_UART_PDL_H)
#define UART_KITPROG_USB_CY_SCB_UART_PDL_H

#include "cyfitter.h"
#include "scb/cy_scb_uart.h"

#if defined(__cplusplus)
extern "C" {
#endif

/***************************************
*   Initial Parameter Constants
****************************************/

#define UART_KITPROG_USB_DIRECTION  (3U)
#define UART_KITPROG_USB_ENABLE_RTS (0U)
#define UART_KITPROG_USB_ENABLE_CTS (0U)

/* UART direction enum */
#define UART_KITPROG_USB_RX    (0x1U)
#define UART_KITPROG_USB_TX    (0x2U)

#define UART_KITPROG_USB_ENABLE_RX  (0UL != (UART_KITPROG_USB_DIRECTION & UART_KITPROG_USB_RX))
#define UART_KITPROG_USB_ENABLE_TX  (0UL != (UART_KITPROG_USB_DIRECTION & UART_KITPROG_USB_TX))


/***************************************
*        Function Prototypes
***************************************/
/**
* \addtogroup group_general
* @{
*/
/* Component specific functions. */
void UART_KITPROG_USB_Start(void);

/* Basic functions */
__STATIC_INLINE cy_en_scb_uart_status_t UART_KITPROG_USB_Init(cy_stc_scb_uart_config_t const *config);
__STATIC_INLINE void UART_KITPROG_USB_DeInit(void);
__STATIC_INLINE void UART_KITPROG_USB_Enable(void);
__STATIC_INLINE void UART_KITPROG_USB_Disable(void);

/* Register callback. */
__STATIC_INLINE void UART_KITPROG_USB_RegisterCallback(cy_cb_scb_uart_handle_events_t callback);

/* Configuration change. */
#if (UART_KITPROG_USB_ENABLE_CTS)
__STATIC_INLINE void UART_KITPROG_USB_EnableCts(void);
__STATIC_INLINE void UART_KITPROG_USB_DisableCts(void);
#endif /* (UART_KITPROG_USB_ENABLE_CTS) */

#if (UART_KITPROG_USB_ENABLE_RTS)
__STATIC_INLINE void     UART_KITPROG_USB_SetRtsFifoLevel(uint32_t level);
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetRtsFifoLevel(void);
#endif /* (UART_KITPROG_USB_ENABLE_RTS) */

__STATIC_INLINE void UART_KITPROG_USB_EnableSkipStart(void);
__STATIC_INLINE void UART_KITPROG_USB_DisableSkipStart(void);

#if (UART_KITPROG_USB_ENABLE_RX)
/* Low level: Receive direction. */
__STATIC_INLINE uint32_t UART_KITPROG_USB_Get(void);
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetArray(void *buffer, uint32_t size);
__STATIC_INLINE void     UART_KITPROG_USB_GetArrayBlocking(void *buffer, uint32_t size);
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetRxFifoStatus(void);
__STATIC_INLINE void     UART_KITPROG_USB_ClearRxFifoStatus(uint32_t clearMask);
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetNumInRxFifo(void);
__STATIC_INLINE void     UART_KITPROG_USB_ClearRxFifo(void);
#endif /* (UART_KITPROG_USB_ENABLE_RX) */

#if (UART_KITPROG_USB_ENABLE_TX)
/* Low level: Transmit direction. */
__STATIC_INLINE uint32_t UART_KITPROG_USB_Put(uint32_t data);
__STATIC_INLINE uint32_t UART_KITPROG_USB_PutArray(void *buffer, uint32_t size);
__STATIC_INLINE void     UART_KITPROG_USB_PutArrayBlocking(void *buffer, uint32_t size);
__STATIC_INLINE void     UART_KITPROG_USB_PutString(char_t const string[]);
__STATIC_INLINE void     UART_KITPROG_USB_SendBreakBlocking(uint32_t breakWidth);
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetTxFifoStatus(void);
__STATIC_INLINE void     UART_KITPROG_USB_ClearTxFifoStatus(uint32_t clearMask);
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetNumInTxFifo(void);
__STATIC_INLINE bool     UART_KITPROG_USB_IsTxComplete(void);
__STATIC_INLINE void     UART_KITPROG_USB_ClearTxFifo(void);
#endif /* (UART_KITPROG_USB_ENABLE_TX) */

#if (UART_KITPROG_USB_ENABLE_RX)
/* High level: Ring buffer functions. */
__STATIC_INLINE void     UART_KITPROG_USB_StartRingBuffer(void *buffer, uint32_t size);
__STATIC_INLINE void     UART_KITPROG_USB_StopRingBuffer(void);
__STATIC_INLINE void     UART_KITPROG_USB_ClearRingBuffer(void);
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetNumInRingBuffer(void);

/* High level: Receive direction functions. */
__STATIC_INLINE cy_en_scb_uart_status_t UART_KITPROG_USB_Receive(void *buffer, uint32_t size);
__STATIC_INLINE void     UART_KITPROG_USB_AbortReceive(void);
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetReceiveStatus(void);
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetNumReceived(void);
#endif /* (UART_KITPROG_USB_ENABLE_RX) */

#if (UART_KITPROG_USB_ENABLE_TX)
/* High level: Transmit direction functions. */
__STATIC_INLINE cy_en_scb_uart_status_t UART_KITPROG_USB_Transmit(void *buffer, uint32_t size);
__STATIC_INLINE void     UART_KITPROG_USB_AbortTransmit(void);
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetTransmitStatus(void);
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetNumLeftToTransmit(void);
#endif /* (UART_KITPROG_USB_ENABLE_TX) */

/* Interrupt handler */
__STATIC_INLINE void UART_KITPROG_USB_Interrupt(void);
/** @} group_general */


/***************************************
*    Variables with External Linkage
***************************************/
/**
* \addtogroup group_globals
* @{
*/
extern uint8_t UART_KITPROG_USB_initVar;
extern cy_stc_scb_uart_config_t const UART_KITPROG_USB_config;
extern cy_stc_scb_uart_context_t UART_KITPROG_USB_context;
/** @} group_globals */


/***************************************
*         Preprocessor Macros
***************************************/
/**
* \addtogroup group_macros
* @{
*/
/** The pointer to the base address of the hardware */
#define UART_KITPROG_USB_HW     ((CySCB_Type *) UART_KITPROG_USB_SCB__HW)
/** @} group_macros */


/***************************************
*    In-line Function Implementation
***************************************/

