chrisjenson/Oscilloscope_Senior_Project/tcom_engineering/embed_sw/tcom_app/tcom_app_psoc6_fixed_io/tcom_displ_test_psoc6.cydsn/Generated_Source/PSoC6/UART_KITPROG_USB.h
/*******************************************************************************
* Function Name: UART_KITPROG_USB_Init
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Init() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_uart_status_t UART_KITPROG_USB_Init(cy_stc_scb_uart_config_t const *config)
{
   return Cy_SCB_UART_Init(UART_KITPROG_USB_HW, config, &UART_KITPROG_USB_context);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_DeInit
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_DeInit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_DeInit(void)
{
    Cy_SCB_UART_DeInit(UART_KITPROG_USB_HW);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_Enable
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Enable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_Enable(void)
{
    Cy_SCB_UART_Enable(UART_KITPROG_USB_HW);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_Disable
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Disable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_Disable(void)
{
    Cy_SCB_UART_Disable(UART_KITPROG_USB_HW, &UART_KITPROG_USB_context);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_RegisterCallback
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_RegisterCallback() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_RegisterCallback(cy_cb_scb_uart_handle_events_t callback)
{
    Cy_SCB_UART_RegisterCallback(UART_KITPROG_USB_HW, callback, &UART_KITPROG_USB_context);
}


#if (UART_KITPROG_USB_ENABLE_CTS)
/*******************************************************************************
* Function Name: UART_KITPROG_USB_EnableCts
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_EnableCts() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_EnableCts(void)
{
    Cy_SCB_UART_EnableCts(UART_KITPROG_USB_HW);
}


/*******************************************************************************
* Function Name: Cy_SCB_UART_DisableCts
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_DisableCts() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_DisableCts(void)
{
    Cy_SCB_UART_DisableCts(UART_KITPROG_USB_HW);
}
#endif /* (UART_KITPROG_USB_ENABLE_CTS) */


#if (UART_KITPROG_USB_ENABLE_RTS)
/*******************************************************************************
* Function Name: UART_KITPROG_USB_SetRtsFifoLevel
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_SetRtsFifoLevel() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_SetRtsFifoLevel(uint32_t level)
{
    Cy_SCB_UART_SetRtsFifoLevel(UART_KITPROG_USB_HW, level);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_GetRtsFifoLevel
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetRtsFifoLevel() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetRtsFifoLevel(void)
{
    return Cy_SCB_UART_GetRtsFifoLevel(UART_KITPROG_USB_HW);
}
#endif /* (UART_KITPROG_USB_ENABLE_RTS) */


/*******************************************************************************
* Function Name: UART_KITPROG_USB_EnableSkipStart
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_EnableSkipStart() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_EnableSkipStart(void)
{
    Cy_SCB_UART_EnableSkipStart(UART_KITPROG_USB_HW);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_DisableSkipStart
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_DisableSkipStart() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_DisableSkipStart(void)
{
    Cy_SCB_UART_DisableSkipStart(UART_KITPROG_USB_HW);
}


#if (UART_KITPROG_USB_ENABLE_RX)
/*******************************************************************************
* Function Name: UART_KITPROG_USB_Get
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Get() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_KITPROG_USB_Get(void)
{
    return Cy_SCB_UART_Get(UART_KITPROG_USB_HW);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_GetArray
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetArray() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetArray(void *buffer, uint32_t size)
{
    return Cy_SCB_UART_GetArray(UART_KITPROG_USB_HW, buffer, size);
}


