chrisjenson/Oscilloscope_Senior_Project/tcom_engineering/embed_sw/tcom_app/tcom_app_psoc6_fixed_io/tcom_displ_test_psoc6.cydsn/Generated_Source/PSoC6/UART_KITPROG_USB.h
/*******************************************************************************
* Function Name: UART_KITPROG_USB_GetArrayBlocking
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetArrayBlocking() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_GetArrayBlocking(void *buffer, uint32_t size)
{
    Cy_SCB_UART_GetArrayBlocking(UART_KITPROG_USB_HW, buffer, size);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_GetRxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetRxFifoStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetRxFifoStatus(void)
{
    return Cy_SCB_UART_GetRxFifoStatus(UART_KITPROG_USB_HW);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_ClearRxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearRxFifoStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_ClearRxFifoStatus(uint32_t clearMask)
{
    Cy_SCB_UART_ClearRxFifoStatus(UART_KITPROG_USB_HW, clearMask);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_GetNumInRxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumInRxFifo() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetNumInRxFifo(void)
{
    return Cy_SCB_UART_GetNumInRxFifo(UART_KITPROG_USB_HW);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_ClearRxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearRxFifo() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_ClearRxFifo(void)
{
    Cy_SCB_UART_ClearRxFifo(UART_KITPROG_USB_HW);
}
#endif /* (UART_KITPROG_USB_ENABLE_RX) */


#if (UART_KITPROG_USB_ENABLE_TX)
/*******************************************************************************
* Function Name: UART_KITPROG_USB_Put
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Put() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_KITPROG_USB_Put(uint32_t data)
{
    return Cy_SCB_UART_Put(UART_KITPROG_USB_HW,data);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_PutArray
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_PutArray() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_KITPROG_USB_PutArray(void *buffer, uint32_t size)
{
    return Cy_SCB_UART_PutArray(UART_KITPROG_USB_HW, buffer, size);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_PutArrayBlocking
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_PutArrayBlocking() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_PutArrayBlocking(void *buffer, uint32_t size)
{
    Cy_SCB_UART_PutArrayBlocking(UART_KITPROG_USB_HW, buffer, size);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_PutString
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_PutString() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_PutString(char_t const string[])
{
    Cy_SCB_UART_PutString(UART_KITPROG_USB_HW, string);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_SendBreakBlocking
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_SendBreakBlocking() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_SendBreakBlocking(uint32_t breakWidth)
{
    Cy_SCB_UART_SendBreakBlocking(UART_KITPROG_USB_HW, breakWidth);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_GetTxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetTxFifoStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetTxFifoStatus(void)
{
    return Cy_SCB_UART_GetTxFifoStatus(UART_KITPROG_USB_HW);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_ClearTxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearTxFifoStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_ClearTxFifoStatus(uint32_t clearMask)
{
    Cy_SCB_UART_ClearTxFifoStatus(UART_KITPROG_USB_HW, clearMask);
}


