chrisjenson/Oscilloscope_Senior_Project/tcom_engineering/embed_sw/tcom_app/tcom_app_psoc6_fixed_io/tcom_displ_test_psoc6.cydsn/Generated_Source/PSoC6/UART_KITPROG_USB.h
/*******************************************************************************
* Function Name: UART_KITPROG_USB_GetNumInTxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumInTxFifo() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetNumInTxFifo(void)
{
    return Cy_SCB_UART_GetNumInTxFifo(UART_KITPROG_USB_HW);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_IsTxComplete
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_IsTxComplete() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE bool UART_KITPROG_USB_IsTxComplete(void)
{
    return Cy_SCB_UART_IsTxComplete(UART_KITPROG_USB_HW);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_ClearTxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearTxFifo() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_ClearTxFifo(void)
{
    Cy_SCB_UART_ClearTxFifo(UART_KITPROG_USB_HW);
}
#endif /* (UART_KITPROG_USB_ENABLE_TX) */


#if (UART_KITPROG_USB_ENABLE_RX)
/*******************************************************************************
* Function Name: UART_KITPROG_USB_StartRingBuffer
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_StartRingBuffer() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_StartRingBuffer(void *buffer, uint32_t size)
{
    Cy_SCB_UART_StartRingBuffer(UART_KITPROG_USB_HW, buffer, size, &UART_KITPROG_USB_context);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_StopRingBuffer
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_StopRingBuffer() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_StopRingBuffer(void)
{
    Cy_SCB_UART_StopRingBuffer(UART_KITPROG_USB_HW, &UART_KITPROG_USB_context);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_ClearRingBuffer
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearRingBuffer() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_ClearRingBuffer(void)
{
    Cy_SCB_UART_ClearRingBuffer(UART_KITPROG_USB_HW, &UART_KITPROG_USB_context);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_GetNumInRingBuffer
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumInRingBuffer() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetNumInRingBuffer(void)
{
    return Cy_SCB_UART_GetNumInRingBuffer(UART_KITPROG_USB_HW, &UART_KITPROG_USB_context);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_Receive
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Receive() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_uart_status_t UART_KITPROG_USB_Receive(void *buffer, uint32_t size)
{
    return Cy_SCB_UART_Receive(UART_KITPROG_USB_HW, buffer, size, &UART_KITPROG_USB_context);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_GetReceiveStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetReceiveStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetReceiveStatus(void)
{
    return Cy_SCB_UART_GetReceiveStatus(UART_KITPROG_USB_HW, &UART_KITPROG_USB_context);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_AbortReceive
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_AbortReceive() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_AbortReceive(void)
{
    Cy_SCB_UART_AbortReceive(UART_KITPROG_USB_HW, &UART_KITPROG_USB_context);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_GetNumReceived
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumReceived() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetNumReceived(void)
{
    return Cy_SCB_UART_GetNumReceived(UART_KITPROG_USB_HW, &UART_KITPROG_USB_context);
}
#endif /* (UART_KITPROG_USB_ENABLE_RX) */


#if (UART_KITPROG_USB_ENABLE_TX)
/*******************************************************************************
* Function Name: UART_KITPROG_USB_Transmit
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Transmit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_uart_status_t UART_KITPROG_USB_Transmit(void *buffer, uint32_t size)
{
    return Cy_SCB_UART_Transmit(UART_KITPROG_USB_HW, buffer, size, &UART_KITPROG_USB_context);
}


