chrisjenson/Oscilloscope_Senior_Project/tcom_engineering/embed_sw/tcom_app/tcom_app_psoc6_fixed_io/tcom_displ_test_psoc6.cydsn/Generated_Source/PSoC6/UART_KITPROG_USB.h
/*******************************************************************************
* Function Name: UART_KITPROG_USB_GetTransmitStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetTransmitStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetTransmitStatus(void)
{
    return Cy_SCB_UART_GetTransmitStatus(UART_KITPROG_USB_HW, &UART_KITPROG_USB_context);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_AbortTransmit
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_AbortTransmit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_AbortTransmit(void)
{
    Cy_SCB_UART_AbortTransmit(UART_KITPROG_USB_HW, &UART_KITPROG_USB_context);
}


/*******************************************************************************
* Function Name: UART_KITPROG_USB_GetNumLeftToTransmit
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumLeftToTransmit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_KITPROG_USB_GetNumLeftToTransmit(void)
{
    return Cy_SCB_UART_GetNumLeftToTransmit(UART_KITPROG_USB_HW, &UART_KITPROG_USB_context);
}
#endif /* (UART_KITPROG_USB_ENABLE_TX) */


/*******************************************************************************
* Function Name: UART_KITPROG_USB_Interrupt
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Interrupt() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void UART_KITPROG_USB_Interrupt(void)
{
    Cy_SCB_UART_Interrupt(UART_KITPROG_USB_HW, &UART_KITPROG_USB_context);
}

#if defined(__cplusplus)
}
#endif

#endif /* UART_KITPROG_USB_CY_SCB_UART_PDL_H */


/* [] END OF FILE */
